//
//  t4.c
//  exercise_140106
//
//  Created by Rimi07 on 14-1-6.
//  Copyright (c) 2014年 cuan. All rights reserved.
//

#include <stdio.h>
//4、	假定一个操作系统有1000个单位的使用空间，每次启动随机占用500-600的空间，如果启动后空间剩余不足10%则系统崩溃。系统运行结束后将产生总空间占用（系统和上次残留）5%的残留，随后用户可以进行清理，每次清理可释放160个单位残留，问一般使用多少次后清理一次，即可保证系统正常使用。
int exer4()
{
    
    printf("第4题:\n");
    
    
    
    printf("\n\n");
    
    return 0;
    
}

// 保证残留<160即可
//1.   2    3   4....
//正好清理不完
//次数     启动占用       残留
// 1         600         30
// 2         630       30+31.5
// 3         661.5     30+31.5+33.。
// i     600 + (i-1)  (600+(i-1))*5%+(i-1)
/*
int i = 1;
float sum = 0;//累计残留数
while (1) {
    sum += (sum + 600)*0.05;
    printf("%d天残留：%f\n",i,sum);
    
    if (sum > 160) {
        break;
    }
    i++;
}
i--;//正好不超出累计残留160
printf("%d\n",i);
*/