//
//  t4.c
//  exercise_140106
//
//  Created by Rimi07 on 14-1-6.
//  Copyright (c) 2014年 cuan. All rights reserved.
//

#include <stdio.h>
#define true 1
//4、	假定一个操作系统有1000个单位的使用空间，每次启动随机占用500-600的空间，如果启动后空间剩余不足10%则系统崩溃。系统运行结束后将产生总空间占用（系统和上次残留）5%的残留，随后用户可以进行清理，每次清理可释放160个单位残留，问一般使用多少次后清理一次，即可保证系统正常使用。
int exer4()
{
    printf("第4题:\n");
    int n = 1;
    int remnant = 0;
    while (true)
    {
        remnant += (remnant+600)*0.05;
        if (remnant > 160)
        {
            break;
        }
//        printf("remnant=%d\n", remnant);
        n++;
    }
    n--;
    printf("%d", n);

    printf("\n\n");
    return 0;
    
}
//     启动           残余
//1    600         600*0.05=30
//2    600+30      30+630*0.05=30+31.5=61.5
//3    600+31.5    61.5+631.5*0.05=61.5+31.575
//n    600+[n-1]残留     [n-1]残留 +（600+[n-1]残留）*0.05
//要保证系统不崩溃，则每次清理的垃圾最接近160个单位为最好，要是垃圾多余160个单位才清理
//会照成垃圾不能清理干净。久而久之会造成系统崩溃


// 保证残留<160即可
//1.   2    3   4....
//正好清理不完
//次数     启动占用       残留
// 1         600         30
// 2         630       30+31.5
// 3         661.5     30+31.5+33.。
// i     600 + (i-1)  (600+(i-1))*5%+(i-1)
/*
int i = 1;
float sum = 0;//累计残留数
while (1) {
    sum += (sum + 600)*0.05;
    printf("%d天残留：%f\n",i,sum);
    
    if (sum > 160) {
        break;
    }
    i++;
}
i--;//正好不超出累计残留160
printf("%d\n",i);
*/